results/rabbit/stage-50/payload-small/100VUs/repeat-2/100vus-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./src/rabbit/rabbitTest.js
        output: json (./results/rabbit/stage-50/payload-small/100VUs/repeat-2/100vus.json)

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 100 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 389 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m01.0s/1m0s

running (0m02.0s), 100/100 VUs, 885 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  0m02.0s/1m0s

running (0m03.0s), 100/100 VUs, 1335 complete and 0 interrupted iterations
default   [   5% ] 100 VUs  0m03.0s/1m0s

running (0m04.0s), 100/100 VUs, 1782 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m04.0s/1m0s

running (0m05.0s), 100/100 VUs, 2259 complete and 0 interrupted iterations
default   [   8% ] 100 VUs  0m05.0s/1m0s

running (0m06.0s), 100/100 VUs, 2741 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  0m06.0s/1m0s

running (0m07.0s), 100/100 VUs, 3221 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m07.0s/1m0s

running (0m06.4s), 100/100 VUs, 3672 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  0m08.0s/1m0s

running (0m07.4s), 100/100 VUs, 4160 complete and 0 interrupted iterations
default   [  15% ] 100 VUs  0m09.0s/1m0s

running (0m08.4s), 100/100 VUs, 4619 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m10.0s/1m0s

running (0m09.4s), 100/100 VUs, 5095 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  0m11.0s/1m0s

running (0m10.4s), 100/100 VUs, 5561 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  0m12.0s/1m0s

running (0m11.4s), 100/100 VUs, 6033 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  0m13.0s/1m0s

running (0m12.4s), 100/100 VUs, 6475 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  0m14.0s/1m0s

running (0m13.4s), 100/100 VUs, 6969 complete and 0 interrupted iterations
default   [  25% ] 100 VUs  0m15.0s/1m0s

running (0m14.4s), 100/100 VUs, 7460 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  0m16.0s/1m0s

running (0m15.4s), 100/100 VUs, 7924 complete and 0 interrupted iterations
default   [  28% ] 100 VUs  0m17.0s/1m0s

running (0m16.4s), 100/100 VUs, 8377 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  0m18.0s/1m0s

running (0m17.4s), 100/100 VUs, 8850 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  0m19.0s/1m0s

running (0m18.4s), 100/100 VUs, 9336 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  0m20.0s/1m0s

running (0m19.4s), 100/100 VUs, 9818 complete and 0 interrupted iterations
default   [  35% ] 100 VUs  0m21.0s/1m0s

running (0m20.4s), 100/100 VUs, 10285 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  0m22.0s/1m0s

running (0m21.4s), 100/100 VUs, 10760 complete and 0 interrupted iterations
default   [  38% ] 100 VUs  0m23.0s/1m0s

running (0m22.4s), 100/100 VUs, 11241 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  0m24.0s/1m0s

running (0m23.4s), 100/100 VUs, 11695 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  0m25.0s/1m0s

running (0m24.4s), 100/100 VUs, 12176 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  0m26.0s/1m0s

running (0m25.4s), 100/100 VUs, 12664 complete and 0 interrupted iterations
default   [  45% ] 100 VUs  0m27.0s/1m0s

running (0m26.4s), 100/100 VUs, 13124 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  0m28.0s/1m0s

running (0m27.4s), 100/100 VUs, 13589 complete and 0 interrupted iterations
default   [  48% ] 100 VUs  0m29.0s/1m0s

running (0m28.4s), 100/100 VUs, 14063 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  0m30.0s/1m0s

running (0m29.4s), 100/100 VUs, 14531 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  0m31.0s/1m0s

running (0m30.4s), 100/100 VUs, 15004 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  0m32.0s/1m0s

running (0m31.4s), 100/100 VUs, 15499 complete and 0 interrupted iterations
default   [  55% ] 100 VUs  0m33.0s/1m0s

running (0m32.4s), 100/100 VUs, 15953 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  0m34.0s/1m0s

running (0m33.4s), 100/100 VUs, 16418 complete and 0 interrupted iterations
default   [  58% ] 100 VUs  0m35.0s/1m0s

running (0m34.4s), 100/100 VUs, 16897 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  0m36.0s/1m0s

running (0m35.4s), 100/100 VUs, 17363 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  0m37.0s/1m0s

running (0m34.7s), 100/100 VUs, 17858 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  0m38.0s/1m0s

running (0m35.7s), 100/100 VUs, 18314 complete and 0 interrupted iterations
default   [  65% ] 100 VUs  0m39.0s/1m0s

running (0m36.7s), 100/100 VUs, 18793 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  0m40.0s/1m0s

running (0m37.7s), 100/100 VUs, 19278 complete and 0 interrupted iterations
default   [  68% ] 100 VUs  0m41.0s/1m0s

running (0m38.7s), 100/100 VUs, 19739 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  0m42.0s/1m0s

running (0m39.7s), 100/100 VUs, 20195 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  0m43.0s/1m0s

running (0m40.7s), 100/100 VUs, 20685 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  0m44.0s/1m0s

running (0m41.7s), 100/100 VUs, 21156 complete and 0 interrupted iterations
default   [  75% ] 100 VUs  0m45.0s/1m0s

running (0m42.7s), 100/100 VUs, 21635 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  0m46.0s/1m0s

running (0m43.7s), 100/100 VUs, 22110 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  0m47.0s/1m0s

running (0m44.7s), 100/100 VUs, 22588 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  0m48.0s/1m0s

running (0m45.7s), 100/100 VUs, 23056 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  0m49.0s/1m0s

running (0m46.7s), 100/100 VUs, 23523 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  0m50.0s/1m0s

running (0m47.7s), 100/100 VUs, 23998 complete and 0 interrupted iterations
default   [  85% ] 100 VUs  0m51.0s/1m0s

running (0m48.7s), 100/100 VUs, 24469 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  0m52.0s/1m0s

running (0m49.7s), 100/100 VUs, 24962 complete and 0 interrupted iterations
default   [  88% ] 100 VUs  0m53.0s/1m0s

running (0m50.7s), 100/100 VUs, 25402 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  0m54.0s/1m0s

running (0m51.7s), 100/100 VUs, 25894 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  0m55.0s/1m0s

running (0m52.7s), 100/100 VUs, 26372 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  0m56.0s/1m0s

running (0m53.7s), 100/100 VUs, 26837 complete and 0 interrupted iterations
default   [  95% ] 100 VUs  0m57.0s/1m0s

running (0m54.7s), 100/100 VUs, 27328 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  0m58.0s/1m0s

running (0m55.7s), 100/100 VUs, 27790 complete and 0 interrupted iterations
default   [  98% ] 100 VUs  0m59.0s/1m0s

running (0m56.7s), 100/100 VUs, 28273 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    CUSTOM
    benchmark_slow_failure_rate....: 0.00%  0 out of 28373
    benchmark_total_failure_rate...: 0.00%  0 out of 28373

    HTTP
    http_req_duration..............: avg=208.69ms min=-496073836ns med=207.37ms max=309.04ms p(90)=227.46ms p(95)=243.35ms
      { expected_response:true }...: avg=208.69ms min=-496073836ns med=207.37ms max=309.04ms p(90)=227.46ms p(95)=243.35ms
    http_req_failed................: 0.00%  0 out of 28373
    http_reqs......................: 28373  498.279294/s

    EXECUTION
    iteration_duration.............: avg=211.81ms min=200.65ms     med=207.49ms max=314.31ms p(90)=228.03ms p(95)=243.62ms
    iterations.....................: 28373  498.279294/s
    vus............................: 100    min=100        max=100
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 7.1 MB 124 kB/s
    data_sent......................: 4.4 MB 78 kB/s



running (0m56.9s), 000/100 VUs, 28373 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  1m0s